app/Http/Controllers/HomeController.php

select * from `courses` order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `courses`
---
    public function index()
    {
        return view('guest.landing', [
            'courses' => Course::orderBy('created_at', 'desc')->paginate(6),
        ]);